OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/heatTransfer/chtMultiRegionFoam/coolingCylinder2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication topoSet

runApplication splitMeshRegions -cellZones -defaultRegionName fluid -overwrite

paraFoam -region fluid -touch
paraFoam -region solid -touch

runApplication $(getApplication)

#------------------------------------------------------------------------------
